Комплексная_автоматизация_2_МОМ_2019/src/AccumulationRegisters/РасчетыНалогоплательщиковСБюджетомПоНДФЛ/РасчетыНалогоплательщиковСБюджетомПоНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыНалогоплательщиковСБюджетомПоНДФЛ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.ТерриторияВыполненияРаботВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ДокументыОснованияНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУдержания</name>
    <type>
      <types>EnumRef.ВариантыУдержанияНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВДекларациюПоНалогуНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетМежрасчетногоПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВыплаченногоДохода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПеречисления</name>
    <type>
      <types>EnumRef.СрокиПеречисляемогоНалога</types>
    </type>
  </attributes>
  <attributes>
    <name>КрайнийСрокУплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВыплаченныйДоходВ6НДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияДоходаФиксирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстаревшаяДатаПолученияДохода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарегистрированоПриНачисленииАванса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНалогообложенияРезидента</name>
    <type>
      <types>EnumRef.НДФЛСтавкиНалогообложенияРезидента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНалоговогоПериода</name>
    <comment>АПК:58 имя сохранено ради обратной совместимости</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДохода</name>
    <comment>АПК:58 имя ВидДохода уже занято</comment>
    <type>
      <types>EnumRef.КатегорииДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьКодДохода</name>
    <type>
      <types>CatalogRef.УдалитьВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодДохода</name>
    <type>
      <types>CatalogRef.ВидыДоходовНДФЛ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/AccumulationRegisters/РасчетыНалогоплательщиковСБюджетомПоНДФЛ/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Регистратор = Отбор.Регистратор.Значение;
	
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если СтрокаНабора.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			Если Не ЗначениеЗаполнено(СтрокаНабора.ДокументОснование) Тогда
				СтрокаНабора.ДокументОснование = Регистратор;
			КонецЕсли;
		ИначеЕсли СтрокаНабора.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.ЗачетАвансовыхПлатежей Тогда	
			Если Не ЗначениеЗаполнено(СтрокаНабора.ДокументОснование) Тогда
				СтрокаНабора.ДокументОснование = Регистратор;
			КонецЕсли;
		ИначеЕсли СтрокаНабора.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.ВозвращеноНалоговымАгентом Тогда	
			СтрокаНабора.КрайнийСрокУплаты = '00010101'
		КонецЕсли;
	КонецЦикла;
	
	УчетНДФЛ.ПроставитьКрайнийСрокУплаты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
